[
    {
        "name": "CSS",
        "imageUrl": "homePage/css.png",
        "level": "Beginner",
        "description": "I have learnt about the basic styling of CSS such as defining the layout of the pages, performing basic animations and making responsive pages. I also explored and have some basic understandings about Bootstrap."
    },
    {
        "name": "Javascript",
        "imageUrl": "homePage/javascript.png",
        "level": "Intermediate",
        "description": "I have learnt about the basic syntax of Javascript such as implementing conditional logics and interacting with the components. I also know the React library and used it to develop several websites including this website."
    },
    {
        "name": "HTML",
        "imageUrl": "homePage/html.png",
        "level": "Intermediate",
        "description": "I have gone through the basic html tags that will be used and built several websites with it."
    },
    {
        "name": "ReactJS",
        "imageUrl": "homePage/reactjs.png",
        "level": "Intermediate",
        "description": "I have the basic understanding about the functional and class components, props, state and hooks as well as the lifecycle. I have been using ReactJS to build the website for several projects."
    },
    {
        "name": "VueJS",
        "imageUrl": "homePage/vuejs.png",
        "level": "Intermediate",
        "description": "I have the basic understanding about the options API and components API, directive, props, events, and slots as well as the lifecycle hooks. I have been using VueJS to develop an open source repository for the FHIR Starters project."
    },
    {
        "name": "Docker",
        "imageUrl": "homePage/docker.png",
        "level": "Intermediate",
        "description": "I know the basic syntax of writing a docker file such as mapping the port of containers to server, defining docker file to run the react and flask applications. I also learnt how to run multiple docker containers by using docker compose."
    },
    {
        "name": "Nginx",
        "imageUrl": "homePage/nginx.png",
        "level": "Beginner",
        "description": "I have a little bit of experiences in using Nginx and built a load balancer for a single production server before."
    },
    {
        "name": "PostgreSQL",
        "imageUrl": "homePage/postgresql.png",
        "level": "Intermediate",
        "description": "I have been managing a PostgreSQL database for a production server. I knew the basic syntax of PostgreSQL such as HAVING and INNER JOIN. I also have some knowledge about DBMS such as normalization and ERD diagram."
    },
    {
        "name": "Python",
        "imageUrl": "homePage/python.png",
        "level": "Intermediate",
        "description": "I have learnt about the basic syntax and data structures in Python, implemented backend APIs for a production website by using Flask and conducted some of the mini data science projects by using Python."
    },
    {
        "name": "Java",
        "imageUrl": "homePage/java.png",
        "level": "Intermediate",
        "description": "I have the knowledge about the basic syntax and data structures in Java. I also have been using the JavaFX to build the GUI and JDBC driver to connect a MySQL database for the assignments of the courses in my university."
    },
    {
        "name": "C++",
        "imageUrl": "homePage/C++.png",
        "level": "Beginner",
        "description": "I have the basic understandings of C++ such as pointers, data structure and conditional logics. I have been using it to solve some of the competitive programming questions on Leetcode."
    },
    {
        "name": "C#",
        "imageUrl": "homePage/Csharp.png",
        "level": "Intermediate",
        "description": "I have the understandings about the basic syntax of C# and experiences of debugging the windows application that are built by using C#."
    },
    {
        "name": "Golang",
        "imageUrl": "homePage/golang.png",
        "level": "Beginner",
        "description": "I have learnt about the basic syntax of Golang such as defining data structure and implementing conditional logics. I also once built the backend of the chat module with socket by using it."
    },
    {
        "name": "R",
        "imageUrl": "homePage/R.png",
        "level": "Beginner",
        "description": "I have the basic understandings about R and built a shiny webapp with it before."
    }
]